"""1.Анаграма - переставлення літер у слові, завдяки чому утворюється нове
значення слова. Напишіть програму, яка перевіряє, чи є два введених
слова анаграмами. Програма повинна вивести True в разі, якщо введені слова
є анаграмами, і False в інших випадках. Слово може складатися тільки
з англійських символів. Регістр букв не повинен впливати на відповідь.
Автор: Бернацька Юлія 31І
"""
# Зчитування
one_word = input("Введіть перше слово: ").lower()
two_word = input("Введіть друге слово: ").lower()

# Перевірка на анаграмність
if sorted(one_word) == sorted(two_word):
    print("Слова є анаграмами.")
else:
    print("Слова не є анаграмами.")
