"""2. Дано два списки чисел, які можуть містити до 10000 чисел кожен.
Виведіть всі числа, які входять як в перший, так і в другий список в
порядку зростання. Вводяться два списки цілих чисел.
Всі числа кожного списку знаходяться на окремому рядку.
Автор: Бернацька Юлія 31І
"""
# Введення першого списку чисел
input_numbers1 = input("Введіть перший список чисел (розділіть числа пробілами): ")
numbers1 = []
for num in input_numbers1.split():
    numbers1.append(int(num))

# Введення другого списку чисел
input_numbers2 = input("Введіть другий список чисел (розділіть числа пробілами): ")
numbers2 = []
for num in input_numbers2.split():
    numbers2.append(int(num))
    
common_numbers = sorted(set(numbers1) & set(numbers2))

# Виведення результату
if common_numbers:
    print("Спільні числа у порядку зростання:", *common_numbers)
else:
    print("Спільних чисел не знайдено.")
