"""На станції ремонту автомобілів працює кілька працівників.
Якщо який-небудь працівник працює понад 40 годин на тиждень,
він отримує в 1,5 рази більше від звичайної погодинної оплати.
Розробіть програму, яка розраховує заробітну плату працівника,
включаючи оплату за додаткові години. Програма отримує на
вхід два цілих числа - кількість робочих годин і ставку погодинної оплати.
Автор: Бернацька Юлія"""
#Вводимо значення
oclock = int(input('Ведіть кількість робочих годин:'))
paid_one_hourse = int(input('Ведіть ставку погодинної оплати:'))


if oclock > 40:
    #Обчислюю скільки додатково працював робітник
    overtime_hours = oclock - 40
    #Обчислюю скільки оплатять за додатковід години
    overtime_pay = overtime_hours * 1.5 * paid_one_hourse
    salary_usually = oclock * paid_one_hourse
    total_pay = salary_usually + overtime_pay
    print(f"Загальна зарплата: {total_pay}")
else:
    # Розрахунок звичайної зарплати без перерахунку за перевищення робочого часу
    salary_usually = oclock * paid_one_hourse
    print(f"Зарплата: {salary_usually}")
