"""1.Дано дійсне додатне число a і ціле число n, яке може набувати додатних і
від’ємних значень. Напишіть функцію для обчислення an. Стандартною функцією
піднесення до степеня і оператором ** користуватися не можна.
Автор: Бернацька Юлія 31І
"""
def step (a, b):
    result = 1.0

    if b < 0:
        a = 1 / a
        b = abs(b)
        
       
    for _ in range(b):
        result *= a

    return result

   

# Приклад використання
a = int(input("Введіть  a: "))
b = int(input("Введіть  b: "))
result = step(a, b)
print({result})

