"""1. Дано n чисел. Перше число на вході n, після чого задано n цілих чисел.
Необхідно порахувати кількість нулів серед введених користувачем чисел.
Автор: Бернацька Юлія 31І 
"""
# Зчитуємо кількість чисел n
n = int(input("Введіть кількість чисел: "))

# нулі
zero_in_list = 0

# Зчитуємо n чисел і підраховуємо кількість нулів
for i in range(n):
    num = int(input(f"Введіть число {i + 1}: "))
    if num == 0:
        zero_in_list += 1

# Виводимо результат
print(f"Кількість нулів серед введених чисел: {zero_in_list}")
