"""2.Оленка вчиться ділити з залишком. Вона взяла деяке число,
розділила його на 2 і відкинула залишок. Те, що вийшло, розділила
на 3 та знову відкинула залишок. Отримане число вона розділила на 4,
відкинула залишок і отримала число k. Яке число могла вибрати Оленка спочатку?
Вводиться натуральне число k, що не перевершує 1000. Необхідно вивести
усіможливі числа,які могла б вибрати спочатку Оленка,
за зростанням, розділяючи їх пропусками.
Автор: Бернацька Юлія 31І
"""

k = int(input("Введіть число k (не більше 1000): "))

# Перебираємо всі можливі числа, які задовольняють умовам задачі
for i in range(1, 1001):
    num1 = i // 2
    num2 = num1 // 3
    num3 = num2 // 4
    
    # Перевірка, чи отримане число дорівнює введеному k
    if num3 == k:
        print(i, end=' ')


